Tekla Open API Reference for Tekla Structures 2025
PourUnit Properties
The PourUnit type exposes the following members.
Properties
Name | Description
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 Gets or sets the name of the pour unit.
Top
See Also
Reference
PourUnit Class
Tekla.Structures.Model Namespace